Brannflakess/CMPE_146_Project/STM32/Core/Src/main.c
#include "main.h"
/* USER CODE BEGIN Includes */
#include <string.h>
#include <stdio.h>
#include <stdlib.h>
#include <stdint.h>
#include "oled_ssd1306.h"
/* Ensure device/CMSIS headers are available via project include paths */
#include "stm32f4xx.h"
#include "stm32f401xe.h"
#include "stm32f4xx_hal_flash_ex.h"

/* Fallback for IntelliSense: define FLASH_LATENCY_0 if HAL headers were not processed */
#ifndef FLASH_LATENCY_0
#define FLASH_LATENCY_0 0
#endif
/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/
I2C_HandleTypeDef hi2c1;
UART_HandleTypeDef huart2;

/* USER CODE BEGIN PV */
/* MPU-6050 definitions ------------------------------------------------------*/
#define MPU6050_ADDR (0x68 << 1)
#define MPU6050_REG_WHO_AM_I 0x75
#define MPU6050_REG_PWR_MGMT_1 0x6B
#define MPU6050_REG_ACCEL_XOUT_H 0x3B

/* General settings ----------------------------------------------------------*/
#define FILTER_SIZE 5
#define SAMPLE_DELAY_MS 80
#define MODE_LOCK_MS 600

/* -------------------------------------------------------------------------- */
/* EXERCISE MODE DETECTION                                                    */
/* -------------------------------------------------------------------------- */
/*
 * Assumption for chest-mounted vertical board:
 *
 * - Standing upright for squats:
 *     |AY| tends to be large (near 1g), while |AZ| is smaller
 *
 * - Horizontal body position for push-ups:
 *     |AZ| tends to be large (near 1g), while |AY| is smaller
 *
 * These values are placeholders and should be tuned from real logs.
 */
#define MODE_GRAVITY_HIGH 13000
#define MODE_GRAVITY_LOW 9000

typedef enum
{
    EXERCISE_UNKNOWN = 0,
    EXERCISE_SQUAT,
    EXERCISE_PUSHUP
} ExerciseMode;

/* -------------------------------------------------------------------------- */
/* SQUAT SETTINGS                                                             */
/* -------------------------------------------------------------------------- */
#define SQUAT_REP_LOCKOUT_MS 1200
#define SQUAT_STAND_THRESHOLD 15000
#define SQUAT_DOWN_THRESHOLD 13800
#define SQUAT_BOTTOM_THRESHOLD 12800
#define SQUAT_UP_THRESHOLD 13800

/* Range/delta-based thresholds (values are in raw sensor units) */
#define SQUAT_DOWN_DELTA 1400   /* drop from baseline to consider going down */
#define SQUAT_BOTTOM_DELTA 2200 /* deeper drop to consider bottom */
#define SQUAT_MIN_ROM 1200      /* minimum peak-to-peak chest travel to count rep */
#define MIN_STATE_HOLD 2

typedef enum
{
    SQUAT_STATE_STANDING = 0,
    SQUAT_STATE_GOING_DOWN,
    SQUAT_STATE_BOTTOM,
    SQUAT_STATE_GOING_UP
} SquatState;

/* -------------------------------------------------------------------------- */
/* PUSH-UP SETTINGS                                                           */
/* -------------------------------------------------------------------------- */
#define PUSHUP_REP_LOCKOUT_MS 900

#define PUSHUP_TOP_THRESHOLD -16500
#define PUSHUP_DOWN_THRESHOLD -15500
#define PUSHUP_BOTTOM_THRESHOLD -14200
#define PUSHUP_UP_THRESHOLD -15200

typedef enum
{
    PUSHUP_STATE_TOP = 0,
    PUSHUP_STATE_GOING_DOWN,
    PUSHUP_STATE_BOTTOM,
    PUSHUP_STATE_GOING_UP
} PushupState;

/* -------------------------------------------------------------------------- */
/* MOVING AVERAGE FILTER                                                      */
/* -------------------------------------------------------------------------- */
typedef struct
{
    int buffer[FILTER_SIZE];
    int index;
    int sum;
    uint8_t filled;
} MovingAverageFilter;

/* Global state --------------------------------------------------------------*/
static ExerciseMode current_mode = EXERCISE_UNKNOWN;
static ExerciseMode candidate_mode = EXERCISE_UNKNOWN;
static uint32_t candidate_mode_start = 0;

static SquatState squat_state = SQUAT_STATE_STANDING;
static uint32_t squat_count = 0;
static uint32_t squat_last_rep_time = 0;
static float squat_baseline_ay = 0.0f;
static uint8_t squat_baseline_init = 0;
static uint8_t squat_state_hold_count = 0;
static float squat_min_ay = 99999.0f;

static PushupState pushup_state = PUSHUP_STATE_TOP;
static uint32_t pushup_count = 0;
static uint32_t pushup_last_rep_time = 0;

static MovingAverageFilter squat_filter = {0};
static MovingAverageFilter pushup_filter = {0};

static uint32_t last_oled_update = 0;
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
void OLED_UpdateScreen(void);
static void MX_GPIO_Init(void);
static void MX_I2C1_Init(void);
static void MX_USART2_UART_Init(void);

/* USER CODE BEGIN PFP */
HAL_StatusTypeDef MPU6050_Init(void);
HAL_StatusTypeDef MPU6050_ReadAccelRaw(int16_t *ax, int16_t *ay, int16_t *az);

int MovingAverage_Update(MovingAverageFilter *f, int new_value);
void MovingAverage_Reset(MovingAverageFilter *f);

ExerciseMode Detect_ExerciseMode(int16_t ax, int16_t ay, int16_t az);
void Update_Mode_Lock(ExerciseMode detected_mode, uint32_t now_ms);

void Squat_Update(int value, uint32_t now_ms);
void Pushup_Update(int value, uint32_t now_ms);

const char *ExerciseMode_ToString(ExerciseMode mode);
const char *SquatState_ToString(SquatState state);
const char *PushupState_ToString(PushupState state);
/* USER CODE END PFP */

/* USER CODE BEGIN 0 */
/* Redirect printf to UART ---------------------------------------------------*/
int __io_putchar(int ch)
{
    HAL_UART_Transmit(&huart2, (uint8_t *)&ch, 1, HAL_MAX_DELAY);
    return ch;
}

/* -------------------------------------------------------------------------- */
/* MPU INIT                                                                   */
/* -------------------------------------------------------------------------- */
HAL_StatusTypeDef MPU6050_Init(void)
{
    uint8_t who_am_i = 0;
    uint8_t wake_data = 0;
    HAL_StatusTypeDef status;

    printf("Starting MPU6050 squat + push-up counter...\r\n");

    status = HAL_I2C_Mem_Read(&hi2c1,
                              MPU6050_ADDR,
                              MPU6050_REG_WHO_AM_I,
                              I2C_MEMADD_SIZE_8BIT,
                              &who_am_i,
                              1,
                              100);

    if (status != HAL_OK)
    {
        printf("WHO_AM_I read failed\r\n");
        return status;
    }

    printf("WHO_AM_I = 0x%02X\r\n", who_am_i);

    if (who_am_i != 0x68)
    {
        printf("Unexpected WHO_AM_I value\r\n");
    }

    wake_data = 0;
    status = HAL_I2C_Mem_Write(&hi2c1,
                               MPU6050_ADDR,
                               MPU6050_REG_PWR_MGMT_1,
                               I2C_MEMADD_SIZE_8BIT,
                               &wake_data,
                               1,
                               100);

    if (status != HAL_OK)
    {
        printf("MPU6050 wake-up failed\r\n");
        return status;
    }

    printf("MPU6050 wake-up successful\r\n");
    HAL_Delay(100);

    return HAL_OK;
}

