Brannflakess/CMPE_146_Project/STM32/Core/Src/main.c
/* -------------------------------------------------------------------------- */
/* MPU READ                                                                   */
/* -------------------------------------------------------------------------- */
HAL_StatusTypeDef MPU6050_ReadAccelRaw(int16_t *ax, int16_t *ay, int16_t *az)
{
    uint8_t accel_data[6];
    HAL_StatusTypeDef status;

    status = HAL_I2C_Mem_Read(&hi2c1,
                              MPU6050_ADDR,
                              MPU6050_REG_ACCEL_XOUT_H,
                              I2C_MEMADD_SIZE_8BIT,
                              accel_data,
                              6,
                              100);

    if (status != HAL_OK)
    {
        return status;
    }

    *ax = (int16_t)((accel_data[0] << 8) | accel_data[1]);
    *ay = (int16_t)((accel_data[2] << 8) | accel_data[3]);
    *az = (int16_t)((accel_data[4] << 8) | accel_data[5]);

    return HAL_OK;
}

/* -------------------------------------------------------------------------- */
/* MOVING AVERAGE                                                             */
/* -------------------------------------------------------------------------- */
int MovingAverage_Update(MovingAverageFilter *f, int new_value)
{
    f->sum -= f->buffer[f->index];
    f->buffer[f->index] = new_value;
    f->sum += new_value;

    f->index++;
    if (f->index >= FILTER_SIZE)
    {
        f->index = 0;
        f->filled = 1;
    }

    if (f->filled)
    {
        return f->sum / FILTER_SIZE;
    }
    else
    {
        int count = f->index;
        if (count == 0)
            count = 1;
        return f->sum / count;
    }
}

void MovingAverage_Reset(MovingAverageFilter *f)
{
    memset(f->buffer, 0, sizeof(f->buffer));
    f->index = 0;
    f->sum = 0;
    f->filled = 0;
}

/* -------------------------------------------------------------------------- */
/* MODE DETECTION                                                             */
/* -------------------------------------------------------------------------- */
ExerciseMode Detect_ExerciseMode(int16_t ax, int16_t ay, int16_t az)
{
    (void)ax; /* not used yet */

    int abs_ay = abs(ay);
    int abs_az = abs(az);

    if ((abs_ay > MODE_GRAVITY_HIGH) && (abs_az < MODE_GRAVITY_LOW))
    {
        return EXERCISE_SQUAT;
    }
    else if ((abs_az > MODE_GRAVITY_HIGH) && (abs_ay < MODE_GRAVITY_LOW))
    {
        return EXERCISE_PUSHUP;
    }
    else
    {
        return EXERCISE_UNKNOWN;
    }
}

void Update_Mode_Lock(ExerciseMode detected_mode, uint32_t now_ms)
{
    if (detected_mode != candidate_mode)
    {
        candidate_mode = detected_mode;
        candidate_mode_start = now_ms;
        return;
    }

    if ((now_ms - candidate_mode_start) >= MODE_LOCK_MS)
    {
        if (current_mode != candidate_mode)
        {
            current_mode = candidate_mode;

            /* Reset filters and per-exercise state when switching modes */
            MovingAverage_Reset(&squat_filter);
            MovingAverage_Reset(&pushup_filter);

            squat_state = SQUAT_STATE_STANDING;
            pushup_state = PUSHUP_STATE_TOP;

            printf("MODE -> %s\r\n", ExerciseMode_ToString(current_mode));
        }
    }
}

/* -------------------------------------------------------------------------- */
/* SQUAT LOGIC                                                                */
/* -------------------------------------------------------------------------- */
void Squat_Update(int value, uint32_t now_ms)
{
    float fvalue = (float)value;
    float delta = 0.0f;

    /* Initialize baseline while standing */
    if (!squat_baseline_init && (squat_state == SQUAT_STATE_STANDING))
    {
        squat_baseline_ay = fvalue;
        squat_baseline_init = 1;
    }

    if (squat_baseline_init)
    {
        /* when standing, slowly track baseline to adapt to drift */
        if (squat_state == SQUAT_STATE_STANDING)
        {
            squat_baseline_ay = (0.95f * squat_baseline_ay) + (0.05f * fvalue);
        }

        delta = squat_baseline_ay - fvalue; /* positive when chest moves down */
    }

    switch (squat_state)
    {
    case SQUAT_STATE_STANDING:
        if (squat_baseline_init && (delta >= SQUAT_DOWN_DELTA))
        {
            squat_state_hold_count++;
            if (squat_state_hold_count >= MIN_STATE_HOLD)
            {
                squat_state = SQUAT_STATE_GOING_DOWN;
                squat_state_hold_count = 0;
                squat_min_ay = fvalue;
                printf("SQUAT STATE -> GOING_DOWN (delta=%.0f)\r\n", delta);
            }
        }
        else
        {
            squat_state_hold_count = 0;
        }
        break;

    case SQUAT_STATE_GOING_DOWN:
        /* track minimum AY while descending */
        if (fvalue < squat_min_ay)
            squat_min_ay = fvalue;
        if (squat_baseline_init && (delta >= SQUAT_BOTTOM_DELTA))
        {
            squat_state_hold_count++;
            if (squat_state_hold_count >= MIN_STATE_HOLD)
            {
                squat_state = SQUAT_STATE_BOTTOM;
                squat_state_hold_count = 0;
                printf("SQUAT STATE -> BOTTOM (delta=%.0f)\r\n", delta);
            }
        }
        else if (squat_baseline_init && (delta < (SQUAT_DOWN_DELTA / 2.0f)))
        {
            /* aborted descent */
            squat_state = SQUAT_STATE_STANDING;
            squat_state_hold_count = 0;
            squat_min_ay = 99999.0f;
            printf("SQUAT STATE -> STANDING (abort)\r\n");
        }
        break;

    case SQUAT_STATE_BOTTOM:
        if (squat_baseline_init && (delta < (SQUAT_BOTTOM_DELTA / 2.0f)))
        {
            squat_state_hold_count++;
            if (squat_state_hold_count >= MIN_STATE_HOLD)
            {
                squat_state = SQUAT_STATE_GOING_UP;
                squat_state_hold_count = 0;
                printf("SQUAT STATE -> GOING_UP\r\n");
            }
        }
        else
        {
            squat_state_hold_count = 0;
        }
        break;

    case SQUAT_STATE_GOING_UP:
        if (squat_baseline_init && (delta <= (SQUAT_DOWN_DELTA / 2.0f)))
        {
            /* compute ROM and decide whether to count */
            float rom = squat_baseline_ay - squat_min_ay;
            if ((now_ms - squat_last_rep_time) > SQUAT_REP_LOCKOUT_MS)
            {
                if (rom >= SQUAT_MIN_ROM)
                {
                    squat_count++;
                    squat_last_rep_time = now_ms;
                    printf("SQUAT COUNT = %lu (rom=%.0f)\r\n", (unsigned long)squat_count, rom);
                }
                else
                {
                    printf("SQUAT REP REJECTED (rom=%.0f min=%d)\r\n", rom, SQUAT_MIN_ROM);
                }
            }

            squat_state = SQUAT_STATE_STANDING;
            squat_min_ay = 99999.0f;
            squat_state_hold_count = 0;
            printf("SQUAT STATE -> STANDING\r\n");
        }
        break;

    default:
        squat_state = SQUAT_STATE_STANDING;
        squat_state_hold_count = 0;
        break;
    }
}

