Brannflakess/CMPE_146_Project/STM32/Core/Src/main.c
/* -------------------------------------------------------------------------- */
/* PUSH-UP LOGIC                                                              */
/* -------------------------------------------------------------------------- */
void Pushup_Update(int value, uint32_t now_ms)
{
    switch (pushup_state)
    {
    case PUSHUP_STATE_TOP:
        /* Going down = value becomes LESS negative */
        if (value > PUSHUP_DOWN_THRESHOLD)
        {
            pushup_state = PUSHUP_STATE_GOING_DOWN;
            printf("PUSHUP STATE -> GOING_DOWN\r\n");
        }
        break;

    case PUSHUP_STATE_GOING_DOWN:
        if (value > PUSHUP_BOTTOM_THRESHOLD)
        {
            pushup_state = PUSHUP_STATE_BOTTOM;
            printf("PUSHUP STATE -> BOTTOM\r\n");
        }
        else if (value < PUSHUP_TOP_THRESHOLD)
        {
            /* Went back to top too early */
            pushup_state = PUSHUP_STATE_TOP;
            printf("PUSHUP STATE -> TOP (reset)\r\n");
        }
        break;

    case PUSHUP_STATE_BOTTOM:
        /* Going up = value becomes MORE negative again */
        if (value < PUSHUP_UP_THRESHOLD)
        {
            pushup_state = PUSHUP_STATE_GOING_UP;
            printf("PUSHUP STATE -> GOING_UP\r\n");
        }
        break;

    case PUSHUP_STATE_GOING_UP:
        if (value < PUSHUP_TOP_THRESHOLD)
        {
            if ((now_ms - pushup_last_rep_time) > PUSHUP_REP_LOCKOUT_MS)
            {
                pushup_count++;
                pushup_last_rep_time = now_ms;
                printf("PUSHUP COUNT = %lu\r\n", (unsigned long)pushup_count);
            }

            pushup_state = PUSHUP_STATE_TOP;
            printf("PUSHUP STATE -> TOP\r\n");
        }
        break;

    default:
        pushup_state = PUSHUP_STATE_TOP;
        break;
    }
}

/* -------------------------------------------------------------------------- */
/* STRING HELPERS                                                             */
/* -------------------------------------------------------------------------- */
const char *ExerciseMode_ToString(ExerciseMode mode)
{
    switch (mode)
    {
    case EXERCISE_SQUAT:
        return "SQUAT";
    case EXERCISE_PUSHUP:
        return "PUSHUP";
    default:
        return "UNKNOWN";
    }
}

const char *SquatState_ToString(SquatState state)
{
    switch (state)
    {
    case SQUAT_STATE_STANDING:
        return "STANDING";
    case SQUAT_STATE_GOING_DOWN:
        return "GOING_DOWN";
    case SQUAT_STATE_BOTTOM:
        return "BOTTOM";
    case SQUAT_STATE_GOING_UP:
        return "GOING_UP";
    default:
        return "UNKNOWN";
    }
}

const char *PushupState_ToString(PushupState state)
{
    switch (state)
    {
    case PUSHUP_STATE_TOP:
        return "TOP";
    case PUSHUP_STATE_GOING_DOWN:
        return "GOING_DOWN";
    case PUSHUP_STATE_BOTTOM:
        return "BOTTOM";
    case PUSHUP_STATE_GOING_UP:
        return "GOING_UP";
    default:
        return "UNKNOWN";
    }
}

void OLED_UpdateScreen(void)
{
    char line[24];

    OLED_Clear();

    OLED_WriteLine(0, "Motion Tracker");

    sprintf(line, "Mode: %s", ExerciseMode_ToString(current_mode));
    OLED_WriteLine(2, line);

    sprintf(line, "Squats: %lu", (unsigned long)squat_count);
    OLED_WriteLine(4, line);

    sprintf(line, "Pushups: %lu", (unsigned long)pushup_count);
    OLED_WriteLine(5, line);

    OLED_Display();
}
/* USER CODE END 0 */

/* -------------------------------------------------------------------------- */
/* MAIN                                                                       */
/* -------------------------------------------------------------------------- */
int main(void)
{
    /* USER CODE BEGIN 1 */

    /* USER CODE END 1 */

    HAL_Init();
    SystemClock_Config();

    MX_GPIO_Init();
    MX_I2C1_Init();
    MX_USART2_UART_Init();

    /* Quick debug: test UART output */
    printf("Hello STM32 UART - Debug Test\r\n");

    /* USER CODE BEGIN 2 */
    if (MPU6050_Init() != HAL_OK)
    {
        printf("MPU init failed. Stopping.\r\n");
        while (1)
        {
            HAL_GPIO_TogglePin(GPIOA, GPIO_PIN_5);
            HAL_Delay(200);
        }
    }

    OLED_Init(&hi2c1);
    OLED_Clear();
    OLED_WriteLine(0, "Starting...");
    OLED_Display();

    printf("Starting combined squat + push-up detection loop...\r\n");
    printf("Chest-mounted IMU mode detection enabled.\r\n");
    printf("Tune thresholds after first real test.\r\n\r\n");
    /* USER CODE END 2 */

    /* USER CODE BEGIN WHILE */
    while (1)
    {
        /* USER CODE END WHILE */

        /* USER CODE BEGIN 3 */
        int16_t ax, ay, az;
        HAL_StatusTypeDef status;

        status = MPU6050_ReadAccelRaw(&ax, &ay, &az);

        if (status == HAL_OK)
        {
            int raw_axis = 0;
            int filtered_axis = 0;
            const char *state_string = "UNKNOWN";
            int ax_g_x100 = (ax * 100) / 16384;
            int ay_g_x100 = (ay * 100) / 16384;
            int az_g_x100 = (az * 100) / 16384;

            ExerciseMode detected_mode = Detect_ExerciseMode(ax, ay, az);
            Update_Mode_Lock(detected_mode, HAL_GetTick());

            if (current_mode == EXERCISE_SQUAT)
            {
                raw_axis = ay;
                filtered_axis = MovingAverage_Update(&squat_filter, raw_axis);
                state_string = SquatState_ToString(squat_state);

                Squat_Update(filtered_axis, HAL_GetTick());

            }
            else if (current_mode == EXERCISE_PUSHUP)
            {
                raw_axis = az;
                filtered_axis = MovingAverage_Update(&pushup_filter, raw_axis);
                state_string = PushupState_ToString(pushup_state);

                Pushup_Update(filtered_axis, HAL_GetTick());

            }
            else
            {
            }
            char json[256];
            sprintf(json, "{\"mode\":\"%s\",\"ax\":%d,\"ay\":%d,\"az\":%d,\"raw\":%d,\"filtered\":%d,\"state\":\"%s\",\"squat_count\":%lu,\"pushup_count\":%lu}\n",
                    ExerciseMode_ToString(current_mode), ax, ay, az, raw_axis, filtered_axis, state_string, (unsigned long)squat_count, (unsigned long)pushup_count);
            printf("%s", json);

